packages.el
;; -*- no-byte-compile: t; -*-
;;; ~/.doom.d/packages.el

;;; Examples:
;; (package! some-package)
;; (package! another-package :recipe (:fetcher github :repo "username/repo"))
;; (package! builtin-package :disable t)

;;; programming enhancement

;;; help packages
(package! cheat-sh)
(package! eldoc-overlay)

;;; convenience functionality
(package! lively)
(package! live-preview)

;; for python
(package! live-py-mode)

;;; emacs enhancements



;;; external browsing inside emacs
;; display and capture utilities for eww, gnus, books, etc.
(package! adoc-mode)
